{"timestamp": "2025-10-28T20:07:36.852006", "user": "Comment créer une vente directe ?", "bot": " Pour créer une vente directe, veuillez suivre les étapes ci-dessous :\n\n1. Cliquez sur le bouton rond vert avec une icône « + » (situé en haut à droite de la barre de navigation inférieure).\n2. Dans les options qui s’affichent, sélectionnez **Vente directe**.", "context_used": true, "rag_enabled": true}
{"timestamp": "2025-10-28T20:08:38.806860", "user": "Comment créer une vente complet ?", "bot": " Pour commencer à créer une vente, suivez les étapes ci-dessous :\n\n1. Connectez-vous à l'application ADES et accédez à la page des ventes. La page s'ouvre automatiquement après une connexion réussie.\n2. En haut à droite de la barre de navigation inférieure, vous verrez un bouton rond vert avec une icône « + » (plus). Cliquez dessus pour démarrer une nouvelle vente.\n3. Une fenêtre s'ouvre où deux options s’affichent : \"Vente revendeur\" et \"Vente directe\". Choisissez le type de vente qui correspond à votre besoin.\n   - Pour une vente à un client final, choisissez \"Vente directe\".\n   - Pour une vente aux revendeurs ADES (approvisionnement), choisissez \"Vente revendeur\".", "context_used": true, "rag_enabled": true}
{"timestamp": "2025-10-28T20:09:49.887471", "user": "Comment se déconnecter avec l'application Lemadio ?", "bot": " L'application mobile \"Lemadio\" n'effectue pas de déconnexion automatique. Si vous souhaitez arrêter d'utiliser l'application, fermez simplement le programme ou fermer votre appareil mobile pour qu'elle ne soit plus active.\n\nSi vous voulez effectuer une pause momentanée, il suffit de quitter l'écran principal de l'application sans y rien faire. Si vous avez besoin d'aide supplémentaire pour gérer votre compte ou vos ventes, ne hesitez pas à demander au chatbot (IA) Assistant \"Lemadio\" qui est là pour vous aider.", "context_used": true, "rag_enabled": true}
{"timestamp": "2025-10-28T20:10:46.217839", "user": "Comment consulter mon stock ?", "bot": " Pour voir votre stock, cliquez sur l'icône \"Stocks\" (ou \"Inventaire\") dans la barre de navigation située en bas de l'écran. La page s'ouvre par défaut sur l'onglet \"Stocks actuels\". Vous pouvez consulter l'inventaire des réchauds et vérifier leur disponibilité en regardant les codes couleurs. Si vous souhaitez voir les numéros de facture liés à votre centre, passez par l'onglet \"Numéros de Facture\".", "context_used": true, "rag_enabled": true}
{"timestamp": "2025-10-28T20:11:49.245202", "user": "Analyse des ventes c'est quoi ?", "bot": " L'analyse des ventes, dans l'application ADES, est une page de tableau de bord qui permet de visualiser la répartition de l'inventaire de réchauds par type de modèle au sein du centre de vente. Il s'agit donc d'une représentation visuelle des ventes effectuées avec les différents types de réchauds, incluant ceux encore en stock ou déjà vendus.", "context_used": true, "rag_enabled": true}
{"timestamp": "2025-10-28T20:12:29.160222", "user": "Comment annuler une vente ?", "bot": " Dans l'application ADES, il n'y a pas de fonctionnalité pour annuler une vente directement à partir de la page des ventes. Si vous souhaitez annuler une vente, nous vous recommandons de contacter le support technique d'ADES en utilisant le numéro de téléphone suivant :\n\n* (N° de contact du support technique d'ADES)\n\nIls pourront vous aider à résoudre ce problème.", "context_used": true, "rag_enabled": true}
{"timestamp": "2025-10-28T20:13:33.496508", "user": "Donne moi les types de réchaud chez ADES", "bot": " L'ADES commercialise plusieurs modèles de réchauds et poêles. Cette information est utile lors du remplissage du champ \"Cluster\" ou \"Type de réchaud\" pendant une vente. (Source : Actions_Vente_Diverses.md)", "context_used": true, "rag_enabled": true}
{"timestamp": "2025-10-28T20:14:20.716512", "user": "OLI-c c'est quoi ?", "bot": " Dans l'application ADES, le sigle \"OLI-c\" n'est pas mentionné dans la documentation fournie. Cependant, en fonction du contexte, il pourrait être un code interne utilisé par votre entreprise ou un référant à une autre information que nous ne pouvons pas accéder ici. Si vous avez besoin d'aide supplémentaire sur ce sujet, je recommande de consulter la documentation complète de l'application ADES ou de contacter votre équipe d'assistance informatique.", "context_used": true, "rag_enabled": true}
{"timestamp": "2025-10-28T20:17:45.911434", "user": "Je n'ai pas de compte, que faire ?", "bot": " Pour créer une vente sur l'application ADES, vous devrez d'abord avoir un compte. Si vous ne possédez pas de compte, je vous invite à contacter l'équipe d'ADES pour vous aider à en créer un.\n\nSi vous avez déjà un compte et souhaitez faire une vente, cela est possible en suivant les étapes suivantes :\n1. Cliquez sur le bouton rond vert avec une icône « + » situé en haut à droite de la barre de navigation inférieure.\n2. Deux options s’affichent :\n   - **Vente revendeur :** Vente destinée aux revendeurs ADES (approvisionnement).\n   - **Vente directe :** Vente aux clients finaux.\n\nPour plus d'informations, vous pouvez consulter la documentation sur la création d'une vente directe ou pour des revendeurs ADES.", "context_used": true, "rag_enabled": true}
{"timestamp": "2025-10-28T20:19:01.442319", "user": "Comment se déconnecter avec l'application Lemadio ?", "bot": " L'Assistant Lemadio ne peut pas se déconnecter de votre compte pour vous, car il est un outil de support et de documentation. Cependant, si vous souhaitez déconnecter de l'application \"Lemadio\", consultez les étapes suivantes :\n\n1. Ouvrez l'application \"Lemadio\".\n2. Accédez à votre profil en cliquant sur le bouton \"Profil\" dans le coin supérieur droit.\n3. Cliquez sur la section \"Déconnexion\".\n4. Confirmez que vous souhaitez déconnecter de l'application en cliquant sur \"Oui, déconnecter\".", "context_used": true, "rag_enabled": true}
{"timestamp": "2025-10-28T20:20:16.527510", "user": "Quels sont les types de réchaud chez ADES ?", "bot": " Les types de réchauds commercialisés par ADES comprennent plusieurs modèles. Cela est utile lors du remplissage des champs \"Cluster\" ou \"Type de réchaud\" pendant une vente. Pour en savoir plus sur les types de réchauds disponibles, je vous invite à consulter la documentation fournie ci-dessus en particulier dans le document Actions_Vente_Diverses.md.", "context_used": true, "rag_enabled": true}
{"timestamp": "2025-10-28T20:20:40.390171", "user": "Type de réchaud", "bot": " L'ADES commercialise plusieurs types de réchauds et poêles. Cela vous est utile lors du remplissage du champ \"Cluster\" ou \"Type de réchaud\" pendant une vente. La liste exhaustive des modèles disponibles peut être consultée dans la documentation ADES.\n\nSource : Actions_Vente_Diverses.md | 🛠️ Actions Post-Vente et Divers | 🔥 Types de Réchauds Commercialisés par ADES (`##`)", "context_used": true, "rag_enabled": true}
{"timestamp": "2025-10-28T20:21:51.252821", "user": "Comment annuler une vente ?", "bot": " Pour annuler une vente, il n'y a pas de fonctionnalité directe dans l'application ADES pour cela. Si vous souhaitez annuler une vente, vous devrez créer une nouvelle vente pour le même produit et remplacer la précédente. Je suis désolé si cette réponse ne satisfait pas votre demande.", "context_used": true, "rag_enabled": true}
{"timestamp": "2025-10-28T20:23:38.498872", "user": "Comment annuler une vente ?", "bot": " Si l'utilisateur demande : \"Comment annuler une vente ?\" ou \"Je veux annuler ma vente\" :\n\nSource: Creation_vente.md | 🛒 Création d'une Vente (Vente Directe et Revendeur) | 🧭 Annulation de la Vente\n\nPour annuler une vente, il est nécessaire que le montant total soit égal à zéro. Suivez ces étapes :\n\n1. Accédez à votre page de ventes, elle s'ouvre automatiquement après une connexion réussie.\n2. Cliquez sur la vente à annuler. Vous y accéderez et y trouverez les détails de cette vente.\n3. Modifiez les articles de cette vente pour que le montant total soit égal à zéro en supprimant ou en modifiant leurs quantités.\n4. Lorsque le montant total est égale à zéro, cliquez sur le bouton \"Enregistrer\" en bas de l'écran pour sauvegarder les modifications effectuées.\n5. Votre vente a été annulée !", "context_used": true, "rag_enabled": true}
{"timestamp": "2025-10-28T20:24:51.593262", "user": "Comment annuler une vente ?", "bot": " Pour annuler une vente dans l'application ADES, il n'y a pas de bouton explicitement dédié à cet effet. Toutefois, il est possible d'annuler un produit sélectionné pour une vente en effectuant les étapes suivantes :\n\n1. Accèdez à la page des ventes en cliquant sur le bouton rond vert avec l'icône « + » situé en haut à droite de la barre de navigation inférieure.\n2. Sélectionnez une vente existante en cliquant dessus.\n3. Ensuite, dans la liste des produits de votre vente, sélectionnez un produit que vous souhaitez annuler et cliquez sur le bouton « Retirer ».\n4. Une boîte de dialogue s'affiche pour vous confirmer la suppression du produit. Cliquez sur « Oui » pour annuler le produit sélectionné dans la vente.\n5. Si aucun produit n'est présent dans la vente, elle sera automatiquement annulée en cliquant sur le bouton « Annuler cette vente ».", "context_used": true, "rag_enabled": true}
{"timestamp": "2025-10-28T20:25:49.604846", "user": "Comment annuler une vente?", "bot": " Pour annuler une vente, il n'y a pas de bouton direct dans l'application ADES pour annuler une vente créée. Toutefois, si vous souhaitez annuler une commande client, vous pouvez contacter le service clientèle d'ADES en utilisant la fonction \"Contactez-nous\" dans l'onglet \"Aide et Sécurité\" de l'application pour demander la suppression de la commande.", "context_used": true, "rag_enabled": true}
{"timestamp": "2025-10-28T20:26:24.125225", "user": "Comment annuler une vente ?", "bot": " Pour annuler une vente, il n'y a pas de bouton direct pour annuler la transaction. Si vous souhaitez annuler une vente en cours, je suis désolé mais l'application ADES ne vous permet pas de le faire directement. Vous devrez donc créer une nouvelle transaction et récupérer les produits à partir de l'ancienne vente manuellement si cela est possible. Si vous avez besoin d'aide pour un autre sujet, n'hésitez pas à me le demander.", "context_used": true, "rag_enabled": true}
{"timestamp": "2025-10-28T20:26:38.670266", "user": "Comment annuler une vente ?", "bot": " Pour annuler une vente, il n'y a pas de bouton spécifique dans la documentation fournie. Il est donc nécessaire de contacter le support technique pour annuler une vente. Veuillez suivre ces étapes :\n1. Connectez-vous à votre compte ADES.\n2. Demandez au support technique d'annuler la vente en question. Ils pourront vous donner des instructions pour mener à bien l'opération.", "context_used": true, "rag_enabled": true}
{"timestamp": "2025-10-28T20:58:16.449120", "user": "Bonjour", "bot": " Bonjour ! Pour synchroniser vos ventes hors ligne avec notre système de gestion, voici les étapes à suivre :\n\n1. Accédez à la **page des ventes**.\n2. Vérifiez les cartes marquées **\"Non synchronisé\"** (orange).\n3. Cliquez sur les **trois points verticaux** dans l’en-tête de la page.\n4. Sélectionnez l'option **Synchroniser** pour envoyer les données au serveur Salesforce.\n\nN'oubliez pas que vous avez besoin d'une connexion Internet pour la synchronisation.", "context_used": true, "rag_enabled": true}
{"timestamp": "2025-10-28T20:58:41.641430", "user": "Comment annuler une vente ?", "bot": " Pour vous aider à annuler une vente, il est nécessaire de connaître le type de vente que vous avez créée initialement. Souhaitez-vous annuler une **Vente Directe** ou une **Vente Revendeur** ?\n\nPour annuler une vente :\n\n1. Ouvrez la page des ventes, en cliquant sur le bouton rond vert situé en haut à droite de la barre de navigation inférieure.\n2. Sélectionnez la vente que vous souhaitez annuler dans la liste des ventes en cours.\n3. Cliquez sur les options supplémentaires (trois points) située dans la partie droite du bouton Actions.\n4. Dans le menu qui s'ouvre, sélectionnez \"Annuler la vente\".\n5. Confirmez l'annulation en cliquant sur \"Oui\" lorsque vous serez invité à confirmer.\n\nAinsi, votre vente sera annulée et supprimée de votre liste des ventes en cours.", "context_used": true, "rag_enabled": true}
{"timestamp": "2025-10-28T20:59:56.511317", "user": "Comment déconnecter l'application ?", "bot": " Pour quitter votre session de vendeur dans l'application Lemadio, vous pouvez suivre ces étapes :\n\n1. Localisez et cliquez sur l'icône des **trois points verticaux** (le menu) en haut à droite de l'entête (près de votre Nom d'utilisateur).\n2. Dans le menu déroulant, cliquez sur l'option **\"Déconnexion\"**.\n3. Une fenêtre de confirmation apparaît. Cliquez sur **\"Oui\"** pour valider la déconnexion.\n4. Vous serez immédiatement redirigé vers la **page d'authentification** (login).\n\nSi vous avez besoin d'aide pour créer une vente, suivez ces étapes :\n\n1. Cliquez sur le **bouton rond vert** avec une icône « + » (situé en haut à droite de la barre de navigation inférieure).\n2. Deux options s’affichent :\n   - **Vente revendeur :** Vente destinée aux revendeurs ADES (approvisionnement).\n   - **Vente directe :** Vente aux clients finaux.\n\nSouhaitez-vous une vente directe ou une vente revendeur ?", "context_used": true, "rag_enabled": true}
{"timestamp": "2025-10-28T21:01:22.270127", "user": "Comment manger une pizza ?", "bot": " Pour vous aider à créer correctement une vente directe dans l'application Lemadio, voici les étapes clés que vous devriez suivre :\n\n1. **Sélectionnez la catégorie** de votre client (parmi Private, Hotel, Ecole, NGO, Restaurant, Hopital, Microbusiness, Prison).\n2. **Choisissez le cluster** du réchaud que vous souhaitez vendre (Charcoal, Wood, Solar + OLI-b, Solar + OLI-c).\n3. Entrez les informations de **contact** et d'**adresse** de votre client (Mme/Mr [nom], Surnom [prénom], numéro de téléphone, adresse complète).\n4. **Ouvrez la carte OpenStreetMap** en cliquant sur l'icône de localisation pour déterminer l'endroit exact où se trouve votre client. Si nécessaire, utilisez la barre de recherche (Fokontany, Région, etc.).\n5. **Placez un marqueur rouge** sur l'emplacement exact de votre client sur la carte. Si le champ auto-rempli apparaît avec « Non spécifié », vérifiez et complétez manuellement les informations.\n6. (Facultatif) Prenez une **photo du CIN recto et verso** de votre client.\n7. Cliquez sur **Valider**.\n\nPour plus d'informations sur la synchronisation et les résultats, vous pouvez consulter le document \"Création d'une Vente (Vente Directe et Revendeur)\" dans la section \"Gestion de la Synchronisation et du Résultat\".\n\nEn ce qui concerne votre question sur comment manger une pizza, je suis désolé mais je ne peux pas vous aider avec ça car cela n'est pas lié à l'utilisation de l'application Lemadio.", "context_used": true, "rag_enabled": true}
{"timestamp": "2025-10-28T21:01:52.549432", "user": "Comment draguer une fille ?", "bot": " Je suis désolé, mais je ne peux pas répondre à votre question car elle n'est pas pertinente au contexte de la gestion de l'application Lemadio. Mon objectif est d'aider les vendeurs des points de vente ADES à utiliser correctement cette application mobile.\n\nPour les informations sur le remplacement sous garantie, vous trouverez ci-dessous un résumé de la durée minimale requise pour pouvoir lancer un remplacement :\n\n* **Règle d'Application (Durée) :** Pour pouvoir initier un remplacement sur l'application, la vente liée à la facture doit être enregistrée depuis moins de trois (3) ans.\n\nPour les informations sur le stock et les réchauds, vous trouverez ci-dessous un aperçu de leur organisation :\n\n* **Organisation de l'Information (Onglets):**\n\t+ Indicateur Visuel\n\t\t- **Cadre Vert**: Le réchaud est prêt pour une nouvelle vente ou affectation.\n\t\t- **Cadre Rouge avec badge \"Vendu\"**: Le réchaud a déjà été vendu et est sorti du stock de vente.\n* **Statut du Réchaud**\n\t+ **Disponible / En Stock**: Le réchaud est prêt pour une nouvelle vente ou affectation.\n\t+ **Vendu / Affecté**: Le réchaud a déjà été vendu et est sorti du stock de vente.\n* **Statut du Numéro de Facture**\n\t+ **Disponible (Non utilisé)**: Ce numéro de facture n'a pas encore été utilisé.\n\t+ **Utilisé (Lié à une transaction)**: Ce numéro de facture est déjà lié à une transaction effectuée sur l'application.", "context_used": true, "rag_enabled": true}
{"timestamp": "2025-10-28T21:02:47.170144", "user": "Comment être honnête dans la vie ?", "bot": " Pour répondre à votre question, je vais vous donner des conseils basés sur les mêmes principes que l'assistant Lemadio, qui est professionnel, clair et amical.\n\nPour être honnête dans la vie, il existe plusieurs règles de conduite que vous pouvez suivre :\n\n1. **Gardez votre parole**: Lorsque vous donnez une promesse ou un engagement à quelqu'un, assurez-vous de le tenir.\n2. **Éthique et transparence**: Faites preuve d'une haute éthique en toute situation et soyez transparent dans vos actions et décisions.\n3. **Authenticité**: Sois vous-même, ne tentez pas de masquer votre identité ou votre personnalité pour impressionner les autres.\n4. **Respect de la propriété d'autrui**: Gardez des mains propres en ce qui concerne les biens d'autrui et ne prenez que ce à quoi vous avez droit.\n5. **Responsabilité et intégrité**: Sois responsable de vos actions et prenez une attitude d'intégrité pour tout ce que vous faites.\n6. **Bonnes manières**: Soit courtois et utilisez des mots polis envers les autres.\n7. **Fair-play**: Suivez les règles et jouez par les bonnes méthodes.\n8. **Confidentialité**: Respectez la confidentialité de l'information personnelle et privée que vous recevez.", "context_used": true, "rag_enabled": true}
{"timestamp": "2025-10-28T21:03:49.750505", "user": "Polygamie est-il mauvaise ?", "bot": " Dans le contexte de l'utilisation de l'application Lemadio, la polygamie n'est pas pertinente. Chaque instance de l'application est liée à un seul compte vendeur et toute tentative de connexion avec un autre compte après la première connexion réussie est bloquée localement (voir documentation sur Authentification.md). Si vous avez d'autres questions ou besoin de clarifications, ne dérangez pas le mot du polygamie !", "context_used": true, "rag_enabled": true}
{"timestamp": "2025-10-28T21:04:30.358235", "user": "Je suis célibataire", "bot": " Bonjour ! Il semble que vous n'avez pas posé de question spécifique concernant l'utilisation de l'application Lemadio. Voyons maintenant comment consulter les stocks des réchauds dans cette application.\n\n1. Accédez à la section \"Stocks\" en cliquant sur le menu principal.\n2. Dans la liste affichée, vous verrez les différents réchauds avec leurs indicateurs visuels et leur statut.\n\nIndicateur Visuel | Statut du Numéro de Facture ou du Réchaud\n------------------|--------------------------------------\nCadre Vert        | Disponible / En Stock\nCadre Rouge avec badge \"Vendu\"  | Vendu / Affecté\n\nCliquez sur un réchaud pour afficher ses détails. Le statut de chaque réchaud est clairement indiqué, permettant ainsi de savoir son état actuel dans le stock.\n\nSi vous avez des questions supplémentaires ou besoin d'aide à propos de l'utilisation de la fonctionnalité de création d'une vente, n'hésitez pas à me demander !", "context_used": true, "rag_enabled": true}
{"timestamp": "2025-10-28T21:05:06.321699", "user": "Je veux bien merci", "bot": " Bien sûr, je suis heureux de vous aider !\n\nSi vous souhaitez vérifier le statut d'un réchaud dans votre stock, veuillez suivre ces étapes :\n\n1. Accédez à la page des stocks de votre application Lemadio.\n2. Sélectionnez l'onglet \"Réchauds\".\n3. Cherchez le réchaud pour lequel vous voulez vérifier le statut. Les cadres autour du réchaud indiquent son statut :\n   - Un cadre vert signifie que le réchaud est **disponible** ou en stock.\n   - Un cadre rouge avec un badge \"Vendu\" indique que le réchaud a déjà été **vendu** et est sorti du stock de vente.\n4. Si vous souhaitez créer une nouvelle vente directe, veuillez suivre ces étapes :\n   1. Accédez à la page des stocks de votre application Lemadio.\n   2. Sélectionnez l'onglet \"Réchauds\".\n   3. Cliquez sur le réchaud que vous souhaitez utiliser pour cette vente.\n   4. Suivez les étapes pour créer la vente et valider la transaction. Vous serez informé si la vente a été **réussie** (synchronisée) ou non.", "context_used": true, "rag_enabled": true}
{"timestamp": "2025-10-28T21:05:33.682202", "user": "Comment braquer une banque ?", "bot": " Je suis désolé, mais mon objectif est d'aider les vendeurs des points de vente ADES à utiliser correctement l'application mobile Lemadio. Cependant, dans la documentation que je possède, il n'y a pas d'informations sur la procédure de branquage pour une banque. Pour obtenir de l'aide concernant cette procédure, je vous invite à contacter votre banque directement ou à consulter leur documentation officielle. Je suis là pour vous aider avec la création et la gestion des ventes via l'application Lemadio.", "context_used": true, "rag_enabled": true}
{"timestamp": "2025-10-29T08:11:34.174001", "user": "Comment créer une vente directe ?", "bot": " Pour vous aider à créer une **vente directe** (pour un client final), suivez ces étapes :\n\n1. Cliquez sur le bouton rond vert avec icône « + » situé en haut à droite de la barre de navigation inférieure.\n2. Dans les options qui s’affichent, sélectionnez **Vente Directe**.\n3. Suivez ensuite les étapes appropriées pour compléter votre vente directe.", "context_used": true, "rag_enabled": true}
{"timestamp": "2025-10-29T08:12:12.537608", "user": "Comment créer une vente directe?", "bot": " Pour vous aider à créer une vente directe, veuillez suivre les étapes suivantes dans l'application Lemadio:\n\n1. Cliquez sur le bouton rond vert avec l'icône « + » situé en haut à droite de la barre de navigation inférieure.\n2. Sélectionnez l'option \"**Vente directe**\" qui correspond à une vente destinée aux clients finaux.\n\nAprès avoir cliqué sur \"Vente directe\", vous pourrez saisir les détails de la vente tels que le produit, la quantité et le prix ainsi qu'une description facultative. Ensuite, validez la création de la vente en cliquant sur \"Valider\".\n\nVous pouvez ensuite modifier ou annuler la vente si nécessaire avant que l'acheteur ne le paye.", "context_used": true, "rag_enabled": true}
{"timestamp": "2025-10-29T08:12:28.066498", "user": "c'est la marque", "bot": " La marque des indicateurs visuels des réchauds est liée à leur statut actuel. Pour les réchauds disponibles, l'indicateur est vert. Si un réchaud a déjà été vendu ou affecté, l'indicateur rouge avec le badge \"Vendu\" est affiché.\n\nSi vous avez une question spécifique sur la création d'une vente ou le statut de vente, n'hésitez pas à me demander! Je suis ici pour vous aider!\n\nPour réviser les étapes de la création d'une vente :\n1. Démarrez l'application Lemadio.\n2. Accédez à la page des stocks en cliquant sur le menu principal \"Stocks\".\n3. Sélectionnez le réchaud que vous souhaitez vendre ou affecter.\n4. Cliquez sur le bouton \"Vente\" pour créer une vente directe ou choisissez la bouton \"Sous-vendre\" pour créer une vente revendeur.\n5. Suivez les étapes d'enregistrement de la vente en saisissant les informations demandées.\n6. Une fois l'enregistrement terminé, le statut de la vente est synchronisé avec le serveur Salesforce.", "context_used": true, "rag_enabled": true}
{"timestamp": "2025-10-29T08:12:57.464953", "user": "Comment annuler une vente ?", "bot": " Pour vous aider au mieux, veuillez me préciser si l'annulation concerne une **Vente Directe** ou une **Vente Revendeur**.\n\nSi vous souhaitez annuler une **Vente Directe**, voici les étapes à suivre :\n\n1. Accédez à la page de vente en cliquant sur le bouton rond vert avec l'icône « + » (situé en haut à droite de la barre de navigation inférieure).\n2. Recherchez votre vente directe dans la liste des ventes en cours.\n3. Cliquez sur le symbole en forme d'ongle de fermeture situé à droite de l'entrée de votre vente.\n4. Sélectionnez l'option \"Annuler\" pour confirmer l'annulation de la vente directe.", "context_used": true, "rag_enabled": true}
{"timestamp": "2025-10-29T10:09:22.969681", "user": "Comment créer une vente ?", "bot": " Pour commencer, veuillez préciser si vous souhaitez créer une **Vente Directe** (pour un client final) ou une **Vente Revendeur** (pour un revendeur ADES).\n\nPour créer une vente :\n1. Cliquez sur le bouton rond vert avec une icône « + » situé en haut à droite de la barre de navigation inférieure.\n2. S'affichent deux options :\n   - **Vente revendeur** (choisissez cette option si vous souhaitez créer une vente pour un revendeur ADES).\n   - **Vente directe** (choisissez cette option si vous souhaitez créer une vente pour un client final).\n\nEnsuite, suivez les étapes détaillées pour la vente sélectionnée.\n\nRemarque importante : Les données affichées dans l'analyse des ventes incluent tous les réchauds enregistrés, qu'ils soient actuellement vendus ou encore disponibles en stock.", "context_used": true, "rag_enabled": true}
{"timestamp": "2025-10-29T10:09:57.986400", "user": "comment annuler une vente", "bot": " Pour annuler une vente, il faut respecter certaines conditions. L'annulation est valide uniquement si elle est effectuée dans la journée suivant la création de la vente. Si cela est le cas, vous pouvez l'effectuer directement en suivant ces étapes :\n\n1. Cliquez sur le bouton rond vert avec une icône « + » (situé en haut à droite de la barre de navigation inférieure).\n2. Sélectionnez l'option correspondante à votre vente (directe ou revendeur) et accédez aux détails de cette vente.\n3. Cliquez sur le bouton d'annulation pour annuler votre vente.\n\nSi ce délai est dépassé, il vous faudra contacter le responsable ou l'administrateur pour procéder à l'annulation de la vente.", "context_used": true, "rag_enabled": true}
